#+TODO: TODO(t) STARTED(s) TESTING(c) | DONE(d)

* In Progress

** Break
   :LOGBOOK:
   CLOCK: [2017-10-04 Wed 10:29]--[2017-10-04 Wed 10:47] =>  0:18
   :END:

** TODO Fix incorrect Cesium plot

   Used the wrong channel: ~H1:SYS-TIMING_C_MA_A_PORT_2_SLAVE_CFC_TIMEDIFF_2~
   is incorrect for LHO Cesium; use
   ~H1:SYS-TIMING_C_MA_A_PORT_2_SLAVE_CFC_TIMEDIFF_1~ instead.

#+NAME: Keita slow channel plot comment
#+BEGIN_SRC
...
you are analyzing H1:SYS-TIMING_C_MA_A_PORT_2_SLAVE_CFC_TIMEDIFF_2, which
is NTP comparator channel and not the atomic clock. That's why your offset
as well as linear drift is very small. Real atomic clock comparison should
look like the LLO data.

The correct channel to analyze is
H1:SYS-TIMING_C_MA_A_PORT_2_SLAVE_CFC_TIMEDIFF_1.
...
A minor point related to the above is that the diagnostic channel plots like
https://dcc.ligo.org/DocDB/0145/T1700441/001/G297595-
diagnostic-channel-plot-comparison.pdf
should include corner station comparator A channels like
L1:SYS-TIMING_C_PPS_A_SIGNAL_1_DIFF both for LLO and LHO. Corner station
comparator B channels are not connected to anything.
...
#+END_SRC

*** DONE Plan
    CLOSED: [2017-10-03 Tue 13:56]
    :LOGBOOK:
    CLOCK: [2017-10-03 Tue 12:41]--[2017-10-03 Tue 13:55] =>  1:14
    :END:

*** DONE Update jobspec
    CLOSED: [2017-10-03 Tue 13:59]
    :LOGBOOK:
    CLOCK: [2017-10-03 Tue 13:56]--[2017-10-03 Tue 13:59] =>  0:03
    :END:

**** DONE Change in channels
     CLOSED: [2017-10-03 Tue 13:58]
**** DONE Change in channel descriptions
     CLOSED: [2017-10-03 Tue 13:58]
**** DONE Change in plots
     CLOSED: [2017-10-03 Tue 13:58]
**** DONE Reset plot properties to blank
     CLOSED: [2017-10-03 Tue 13:58]
**** DONE Update git repo
     CLOSED: [2017-10-03 Tue 13:59]

*** DONE Start download on ligodl
    CLOSED: [2017-10-03 Tue 14:09]
    :LOGBOOK:
    CLOCK: [2017-10-04 Wed 09:53]--[2017-10-04 Wed 09:53] =>  0:00
    CLOCK: [2017-10-03 Tue 13:59]--[2017-10-03 Tue 14:09] =>  0:10
    :END:

    Start downloading the missing channel on my data download server.

    Finished, less than 24 hours for a single channel.

*** TESTING Add utils for easily moving output files around

**** DONE Plan
     CLOSED: [2017-10-04 Wed 09:57]
     :LOGBOOK:
     CLOCK: [2017-10-04 Wed 09:57]--[2017-10-04 Wed 09:57] =>  0:00
     :END:
**** TESTING Add function for getting sha256 sum of out filenames
     :LOGBOOK:
     CLOCK: [2017-10-04 Wed 09:57]--[2017-10-04 Wed 10:02] =>  0:05
     :END:
     [[https://stackoverflow.com/questions/26538588/how-to-sha256-hash-a-variable-in-python][Explanation here.]]
**** TESTING Add function for getting archive filename
     :LOGBOOK:
     CLOCK: [2017-10-04 Wed 10:02]--[2017-10-04 Wed 10:05] =>  0:03
     :END:
**** TESTING Add function for archiving
     :LOGBOOK:
     CLOCK: [2017-10-04 Wed 10:05]--[2017-10-04 Wed 10:15] =>  0:10
     :END:
     [[https://stackoverflow.com/questions/3874837/how-do-i-compress-a-folder-with-the-python-gzip-module][Explanation here.]]
**** TESTING Add function for unarchiving
     :LOGBOOK:
     CLOCK: [2017-10-04 Wed 10:15]--[2017-10-04 Wed 10:26] =>  0:11
     :END:
     [[https://stackoverflow.com/questions/30887979/i-want-to-create-a-script-for-unzip-tar-gz-file-via-python][Explanation here.]]
**** TESTING Add flags
     :LOGBOOK:
     CLOCK: [2017-10-04 Wed 10:47]--[2017-10-04 Wed 10:55] =>  0:08
     :END:
***** TESTING Add -a option for archiving
***** TESTING Add -u option for unarchiving
***** TESTING Add -f option to print archive filename
**** TESTING Update help string with new flags
     :LOGBOOK:
     CLOCK: [2017-10-04 Wed 10:55]--[2017-10-04 Wed 10:59] =>  0:04
     :END:

*** TODO Add a copy of the jobspec file to the archive
    :LOGBOOK:
    CLOCK: [2017-10-04 Wed 11:00]--[2017-10-04 Wed 11:00] =>  0:00
    :END:

*** TODO Copy output files to ldas-pcdev2
*** TODO Generate plots
*** TODO Diagnose faults
*** TODO Update Cesium document

**** TODO Describe faults
**** TODO Update conclusion
**** TODO Update plots in Cesium document

*** TODO Send updated file to Zsuzsa
*** TODO Re-upload to DCC
  
* Done
